Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This guide explains how https://openjdk.org/jeps/328[Flight Recorder] can be extended to provide additional insight into your Quarkus application. JFR records various information from the Java standard API and JVM as events. By adding the Quarkus JFR extension, you can add custom Quarkus events to JFR. This will help you solve potential problems in your application.
ja_jp: このガイドでは、 https://openjdk.org/jeps/328[Flight Recorder] を拡張して、Quarkus アプリケーションに対する洞察を深める方法を説明します。JFR は、Java 標準 API および JVM からのさまざまな情報をイベントとして記録します。Quarkus JFR エクステンションを追加すると、JFR にカスタム Quarkus イベントを追加できます。これにより、アプリケーションの潜在的な問題を解決できます。

source: This guide explains how https://openjdk.org/jeps/328[Java Flight Recorder] (JFR) can be extended to provide additional insight into your Quarkus application. JFR records various information from the Java standard API and JVM as events. By adding the Quarkus JFR extension, you can add custom Quarkus events to JFR. This will help you solve potential problems in your application.
ja_jp: このガイドでは、 https://openjdk.org/jeps/328[Java Flight Recorder] (JFR) を拡張して、Quarkus アプリケーションに対する洞察を深める方法を説明します。 JFR は、Java 標準 API および JVM からのさまざまな情報をイベントとして記録します。 Quarkus JFR エクステンションを追加すると、JFR にカスタム Quarkus イベントを追加できます。これにより、アプリケーションの潜在的な問題を解決できます。

source: This guide explains how to benefit from Java 19 virtual threads when writing REST services in Quarkus.
ja_jp: このガイドではQuarkusでRESTサービスを記述する際にJava 19の仮想スレッドを利用する方法について説明します。

source: This guide explains how to benefit from Java 21+ virtual threads in Quarkus application.
ja_jp: このガイドでは、QuarkusアプリケーションでJava 21+の仮想スレッドを使用する方法について説明します。

source: This guide explains how to benefit from Java virtual threads when implementing a gRPC service.
ja_jp: このガイドでは、gRPCサービスを実装する際にJava仮想スレッドを利用する方法を説明します。

source: This guide explains how to benefit from Java virtual threads when writing message processing applications in Quarkus.
ja_jp: このガイドでは、Quarkusでメッセージ処理アプリケーションを記述する際に、Java仮想スレッドを利用する方法について説明します。

source: This guide explains how to best measure the footprint of a Quarkus application.
ja_jp: このガイドでは、Quarkusアプリケーションのフットプリントを最適に測定する方法について説明します。

source: This guide explains how to cache expensive method calls of your CDI beans using simple annotations.
ja_jp: このガイドでは、シンプルなアノテーションを使用してCDI Beanの高価なメソッド呼び出しをキャッシュする方法を説明します。

source: This guide explains how to centralize your logs with Graylog, Logstash or Fluentd.
ja_jp: このガイドでは、Graylog、Logstash、または Fluentd を使用してログを一元管理する方法について説明します。

source: This guide explains how to centralize your logs with Logstash or Fluentd using the Graylog Extended Log Format (GELF).
ja_jp: このガイドでは、Graylog Extended Log Format (GELF) を使用して Logstash または Fluentd でログを集中管理する方法を説明します。

source: This guide explains how to configure Quarkus to authenticate against well-known OpenID Connect providers such as GitHub, Google, Microsoft, Apple...
ja_jp: このガイドでは、GitHub、Google、Microsoft、Appleなどの有名なOpenID Connectプロバイダーに対して認証するためにQuarkusを設定する方法について説明します。

source: This guide explains how to consume gRPC services in your Quarkus application.
ja_jp: このガイドでは、QuarkusアプリケーションでgRPCサービスを使用する方法について説明します。

source: This guide explains how to create and configure a Quarkus Codestart for an extension.
ja_jp: このガイドでは、エクステンションのために Quarkus Codestart を作成および設定する方法について説明します。

source: This guide explains how to deploy a Quarkus application to Google Cloud.
ja_jp: このガイドでは、QuarkusアプリケーションをGoogle Cloudにデプロイする方法を説明します。

source: This guide explains how to deploy a Quarkus application to Microsoft Azure Cloud.
ja_jp: このガイドでは、QuarkusアプリケーションをMicrosoft Azure Cloudにデプロイする方法を説明します。

source: This guide explains how to deploy your gRPC services in Quarkus to Kubernetes.
ja_jp: このガイドでは、QuarkusのgRPCサービスをKubernetesにデプロイする方法を説明します。

source: This guide explains how to enable automatic registration and deregistration of a Quarkus application using SmallRye Stork and Consul, with minimal or no configuration.
ja_jp: このガイドでは、SmallRye Stork と Consul を使用して、最小限の設定または設定なしで Quarkus アプリケーションの自動登録および登録解除を有効にする方法について説明します。

source: This guide explains how to generate SBOMs for Quarkus applications in the CycloneDX format.
ja_jp: このガイドでは、QuarkusアプリケーションのSBOMをCycloneDX形式で生成する方法を説明します。

source: This guide explains how to implement gRPC services in your Quarkus application.
ja_jp: このガイドでは、QuarkusアプリケーションにgRPCサービスを実装する方法について説明します。

source: This guide explains how to integrate link:https://github.com/smallrye/smallrye-jwt/[SmallRye JWT] into your Quarkus application to implement link:https://tools.ietf.org/html/rfc7519[JSON Web Token (JWT)] security in compliance with the MicroProfile JWT specification. You’ll learn how to verify JWTs, represent them as MicroProfile JWT `org.eclipse.microprofile.jwt.JsonWebToken`, and secure Quarkus HTTP endpoints using bearer token authorization and link:https://en.wikipedia.org/wiki/Role-based_access_control[Role-Based Access Control].
ja_jp: このガイドでは、Quarkus アプリケーションに link:https://github.com/smallrye/smallrye-jwt/[SmallRye JWT] を統合し、MicroProfile JWT 仕様に準拠した link:https://tools.ietf.org/html/rfc7519[JSON Web Token (JWT)] セキュリティーを実装する方法を説明します。 JWT の検証方法、MicroProfile JWT の `org.eclipse.microprofile.jwt.JsonWebToken` としての表現、およびベアラートークン認証と link:https://en.wikipedia.org/wiki/Role-based_access_control[ロールベースアクセス制御 (RBAC)] を使用して Quarkus の HTTP エンドポイントを保護する方法を学びます。

source: This guide explains how to leverage OpenJDK's Ahead-of-Time (AOT) caching capabilities in Quarkus to achieve significantly faster application startup times.
ja_jp: このガイドでは、Quarkus において OpenJDK の Ahead-of-Time (AOT) キャッシング機能を活用し、アプリケーションの起動時間を大幅に短縮する方法について説明します。

source: This guide explains how to leverage SmallRye GraphQL Client to consume GraphQL services.
ja_jp: このガイドでは、SmallRye GraphQL を活用して GraphQL サービスを使用する方法を説明します。

source: This guide explains how to leverage SmallRye GraphQL to implement GraphQL services.
ja_jp: このガイドでは、SmallRye GraphQL を活用して GraphQL サービスを実装する方法を説明します。

source: This guide explains how to measure the test coverage of your Quarkus application.
ja_jp: このガイドでは、Quarkusアプリケーションのテストカバレッジを測定する方法について説明します。

source: This guide explains how to migrate an application from RESTEasy Classic to RESTEasy Reactive.
ja_jp: このガイドではアプリケーションをRESTEasy Classic から RESTEasy Reactive に移行する方法を説明します。

source: This guide explains how to start using gRPC in your Quarkus application.
ja_jp: このガイドでは、QuarkusアプリケーションでgRPCを使用する方法を説明します。

source: This guide explains how to use Blaze-Persistence to simplify your data and DTO layers.
ja_jp: このガイドでは、Blaze-Persistenceを使用してデータとDTOレイヤーを簡素化する方法を説明します。

source: This guide explains how to use Kotlin.
ja_jp: このガイドでは、Kotlinの使い方を説明します。

source: This guide explains how to use Leyden AOT caching with Quarkus for dramatically faster startup times on JDK 24+.
ja_jp: このガイドでは、JDK 24 以降で劇的に起動時間を短縮するために、Quarkus で Leyden AOT キャッシュを使用する方法について説明します。

source: This guide explains how to use OpenID Connect and OAuth2 Client and Filters to acquire, refresh and propagate access tokens.
ja_jp: このガイドでは、OpenID ConnectとOAuth2クライアント、フィルタを使用してアクセストークンを取得、更新、伝播する方法を説明します。

source: This guide explains how to use Sentry to monitor your application and be notified when exceptions occur.
ja_jp: このガイドでは、Sentry を使ってアプリケーションを監視し、例外が発生したときに通知を受ける方法を説明します。

source: This guide explains how to use Stork with Kubernetes for service discovery and load balancing.
ja_jp: このガイドでは、Kubernetes で Stork を使用してサービスの検出と負荷分散を行う方法について説明します。

source: This guide explains how to use Vert.x in Quarkus to build reactive applications.
ja_jp: このガイドでは、QuarkusでVert.xを使用してリアクティブアプリケーションを構築する方法について説明します。

source: This guide explains how to use the OpenAPI extension to generate an OpenAPI descriptor and get a Swagger UI frontend to test your REST endpoints.
ja_jp: このガイドでは、OpenAPI エクステンションを使用して OpenAPI ディスクリプタを生成し、Swagger UI フロントエンドを取得して REST エンドポイントをテストする方法を説明します。

source: This guide explains how to use the Proxy Registry in your Quarkus application.
ja_jp: このガイドでは、Quarkus アプリケーションでプロキシーレジストリーを使用する方法について説明します。

source: This guide explains how to use the REST Client Reactive in order to interact with REST APIs. REST Client Reactive is a non-blocking counterpart of the RESTEasy REST Client.
ja_jp: このガイドでは、REST API と対話するための REST Client Reactive の使用方法について説明します。REST Client Reactive は、RESTEasy REST Client のノンブロッキング版です。

source: This guide explains how to use the REST Client Reactive in order to interact with REST APIs. REST Client Reactive is the REST Client implementation compatible with RESTEasy Reactive.
ja_jp: このガイドでは、REST Client Reactiveを使用して REST API と対話する方法について説明します。REST Client Reactiveは、RESTEasy Reactive と互換性のある REST クライアント実装です。

source: This guide explains how to use the REST Client in order to interact with REST APIs. REST Client is the REST Client implementation compatible with Quarkus REST (formerly RESTEasy Reactive).
ja_jp: このガイドでは、REST APIと対話するためのREST Clientの使用方法について説明します。 RESTクライアントは、Quarkus REST（旧RESTEasy Reactive）と互換性のあるRESTクライアントの実装です。

source: This guide explains how to use the REST Client.
ja_jp: このガイドでは、REST Client の使用方法について説明します。

source: This guide explains how to use the RESTEasy Classic REST Client in order to interact with REST APIs (JSON and other) with very little effort.
ja_jp: このガイドでは、RESTEasy Classic REST Clientを使用して、わずかな労力でREST API（JSONなど）と対話する方法を説明します。

source: This guide explains how to use the RESTEasy Classic REST Client to send multipart REST requests, typically to upload documents.
ja_jp: このガイドでは、RESTEasy Classic REST Client を使用してマルチパート REST リクエストを送信する方法について説明します。

source: This guide explains how to use the RESTEasy REST Client in order to interact with REST APIs with very little effort.
ja_jp: このガイドでは、MicroProfile REST Clientを使用して、ほとんど手間をかけずにREST APIとやりとりする方法を説明します。

source: This guide explains how to use the RESTEasy REST Client in order to interact with REST APIs (JSON and other) with very little effort.
ja_jp: このガイドでは、RESTEasy REST Clientを使ってREST API(JSONなど)とほとんど手間をかけずにやりとりする方法を説明しています。

source: This guide explains how to use the RESTEasy REST Client to send multipart REST requests, typically to upload documents.
ja_jp: このガイドでは、RESTEasy REST クライアントを使用してマルチパート REST リクエストを送信する方法、典型的にはドキュメントをアップロードする方法を説明します。

source: This guide explains how to use the RESTEasy REST Client with Multipart in order to interact with REST APIs requiring `multipart/form-data` content-type with very little effort.
ja_jp: このガイドでは、マルチパートでRESTEasy RESTクライアントを使用して、 `multipart/form-data` コンテンツタイプを必要とするREST APIとわずかな労力でやりとりする方法を説明します。

source: This guide explains how to use the RESTEasy Reactive REST Client.
ja_jp: このガイドではRESTEasy Reactive REST Clientの使用方法を説明します。

source: This guide explains how to use:
ja_jp: このガイドでは以下の使い方を解説しています。

source: This guide explains how to write REST Services with Quarkus REST in Quarkus.
ja_jp: このガイドでは、QuarkusでQuarkus RESTを使用してRESTサービスを記述する方法を説明します。

source: This guide explains how to write REST Services with RESTEasy Reactive in Quarkus.
ja_jp: このガイドでは、QuarkusでRESTEasy Reactiveを使用してRESTサービスを記述する方法を説明します。

source: This guide explains how you can access Git repositories with JGit.
ja_jp: このガイドでは、JGitを使ってGitリポジトリにアクセスする方法を説明します。

source: This guide explains how you can deploy Quarkus-based AWS Lambdas.
ja_jp: このガイドでは、QuarkusベースのAWS Lambdaをデプロイする方法を説明します。

source: This guide explains how you can deploy Quarkus-based Amazon Lambdas.
ja_jp: このガイドでは、QuarkusベースのAmazon Lambdasをデプロイする方法を説明します。

source: This guide explains how you can deploy Quarkus-based Google Cloud Functions.
ja_jp: このガイドでは、QuarkusベースのGoogle Cloud Functionsを導入する方法を説明します。

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as a Google Cloud Function.
ja_jp: このガイドでは、Vert.x Web、Servlet、またはRESTEasyマイクロサービスをGoogle Cloud Functionとしてデプロイする方法を説明します。

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as an AWS Lambda.
ja_jp: このガイドでは、Vert.x Web、Servlet、またはRESTEasyマイクロサービスをAWS Lambdaとしてデプロイする方法を説明します。

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as an Amazon Lambda.
ja_jp: このガイドでは、Vert.x Web、Servlet、またはRESTEasyマイクロサービスをAmazon Lambdaとしてデプロイする方法を説明します。

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as an Azure Function.
ja_jp: このガイドでは、Vert.x Web、Servlet、またはRESTEasyマイクロサービスをAzure Functionとしてデプロイする方法を説明します。

source: This guide explains how you can send your logs to a centralized log management system like Graylog, Logstash (inside the Elastic Stack or ELK - Elasticsearch, Logstash, Kibana) or Fluentd (inside EFK - Elasticsearch, Fluentd, Kibana).
ja_jp: このガイドでは、Graylog、Logstash(Elastic StackやELK - Elasticsearch、Logstash、Kibanaの内部)、Fluentd(EFK - Elasticsearch、Fluentd、Kibanaの内部)のような集中型ログ管理システムにログを送信する方法を説明します。

source: This guide explains how you can use HashiCorp Vault for "encryption as a service".
ja_jp: このガイドでは、HashiCorp Vaultを「サービスとしての暗号化」に使用する方法を説明しています。

source: This guide explains how you can use HashiCorp Vault to securely store your credentials in Quarkus.
ja_jp: このガイドでは、HashiCorp Vaultを使用してQuarkusにクレデンシャルを安全に保存する方法について説明します。

source: This guide explains how your Quarkus application can expose its API description through an OpenAPI specification and how you can test it via a user-friendly UI named Swagger UI.
ja_jp: このガイドでは、QuarkusアプリケーションがOpenAPI仕様でAPIの説明を公開する方法と、Swagger UIというユーザーフレンドリーなUIを介してテストする方法について説明します。

source: This guide explains how your Quarkus application can read configuration properties at runtime from Consul.
ja_jp: このガイドでは、Quarkusアプリケーションが実行時にConsulから設定プロパティを読み取る方法について説明します。

source: This guide explains how your Quarkus application can read configuration properties at runtime from the https://cloud.spring.io/spring-cloud-config[Spring Cloud Config Server].
ja_jp: このガイドでは、Quarkusアプリケーションが実行時に https://cloud.spring.io/spring-cloud-config[Spring Cloud Config Server]から設定プロパティを読み取る方法を説明します。

source: This guide explains how your Quarkus application can utilize OAuth2 tokens to provide secured access to the JAX-RS endpoints.
ja_jp: このガイドでは、QuarkusアプリケーションがOAuth2トークンを利用して、JAX-RSエンドポイントへのセキュアなアクセスを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize OAuth2 tokens to provide secured access to the Jakarta REST (formerly known as JAX-RS) endpoints.
ja_jp: このガイドでは、QuarkusアプリケーションがOAuth2トークンを利用して、Jakarta REST（旧称JAX-RS）エンドポイントへのセキュアなアクセスを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize OAuth2 tokens to provide secured access to the Jakarta REST endpoints.
ja_jp: このガイドでは、QuarkusアプリケーションでOAuth2トークンを利用して、JAX-RSエンドポイントへのセキュアなアクセスを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize OpenTelemetry Logging to provide centralised logging for interactive web applications.
ja_jp: このガイドでは、Quarkus アプリケーションが OpenTelemetry Logging を利用して、インタラクティブな Web アプリケーションに一元化されたロギングを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize OpenTelemetry Logging to provide distributed logging for interactive web applications.
ja_jp: このガイドでは、QuarkusアプリケーションがOpenTelemetry Loggingを利用して、インタラクティブなWebアプリケーションに分散ロギングを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize OpenTelemetry Tracing to provide distributed tracing for interactive web applications.
ja_jp: このガイドでは、QuarkusアプリケーションがOpenTelemetry Tracingを利用して、インタラクティブなWebアプリケーションに分散トレースを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize OpenTelemetry to provide distributed tracing for interactive web applications.
ja_jp: このガイドでは、QuarkusアプリケーションでOpenTelemetry を使用してインタラクティブなウェブアプリケーションで分散トレースを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize OpenTelemetry to provide metrics for interactive web applications.
ja_jp: このガイドでは、QuarkusアプリケーションがOpenTelemetryを利用して、インタラクティブなWebアプリケーションのメトリクスを提供する方法を説明します。

source: This guide explains how your Quarkus application can utilize OpenTelemetry to provide observability for interactive web applications.
ja_jp: このガイドでは、QuarkusアプリケーションがどのようにOpenTelemetryを利用し、インタラクティブなWebアプリケーションにオブザーバビリティを提供できるかについて説明します。

source: This guide explains how your Quarkus application can utilize OpenTracing to provide distributed tracing for interactive web applications.
ja_jp: このガイドでは、QuarkusアプリケーションがOpenTracingを利用してインタラクティブなウェブアプリケーションのための分散トレースを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize https://github.com/smallrye/smallrye-jwt/[SmallRye JWT] to verify https://tools.ietf.org/html/rfc7519[JSON Web Token]s, represent them as MicroProfile JWT `org.eclipse.microprofile.jwt.JsonWebToken` and provide secured access to the Quarkus HTTP endpoints using Bearer Token Authorization and https://en.wikipedia.org/wiki/Role-based_access_control[Role-Based Access Control].
ja_jp: このガイドでは、Quarkusアプリケーションが https://github.com/smallrye/smallrye-jwt/[SmallRye JWT] を利用して、 link:https://tools.ietf.org/html/rfc7519[JSON Web Token] を検証し、MicroProfile JWT `org.eclipse.microprofile.jwt.JsonWebToken` として表現し、Bearer Token Authorizationと link:https://en.wikipedia.org/wiki/Role-based_access_control[Role-Based Access Control] を使用してQuarkus HTTPエンドポイントへのセキュアなアクセスを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize https://opentelemetry.io/[OpenTelemetry] (OTel) to provide Observability for interactive web applications.
ja_jp: このガイドでは、Quarkus アプリケーションで https://opentelemetry.io/[OpenTelemetry] (OTel) を利用して、インタラクティブなWebアプリケーションにオブザーバビリティを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize https://opentelemetry.io/[OpenTelemetry] (OTel) to provide distributed logging for interactive web applications.
ja_jp: このガイドでは、Quarkusアプリケーションで https://opentelemetry.io/[OpenTelemetry] (OTel) を利用して、インタラクティブなWebアプリケーションに分散ロギングを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize https://opentelemetry.io/[OpenTelemetry] (OTel) to provide distributed tracing for interactive web applications.
ja_jp: このガイドでは、Quarkus アプリケーションで link:https://opentelemetry.io/[OpenTelemetry] (OTel) を利用して、 インタラクティブな Web アプリケーションに分散トレースを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize https://opentelemetry.io/[OpenTelemetry] (OTel) to provide metrics for interactive web applications.
ja_jp: このガイドでは、Quarkus アプリケーションで https://opentelemetry.io/[OpenTelemetry] (OTel) を利用して、インタラクティブなWebアプリケーションにメトリクスを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize https://opentelemetry.io/[OpenTelemetry] (OTel) to provide structured, contextual, vendor-neutral and centralised logging for interactive web applications.
ja_jp: このガイドでは、Quarkusアプリケーションで https://opentelemetry.io/[OpenTelemetry] (OTel) を利用して、インタラクティブなWebアプリケーション向けに構造化され、コンテキストに応じ、ベンダーに依存しない、一元化されたロギングを提供する方法について説明します。

source: This guide explains how your Quarkus application can utilize https://opentelemetry.io/[OpenTelemetry] to provide distributed tracing for interactive web applications.
ja_jp: このガイドでは、Quarkusアプリケーションが link:https://opentelemetry.io/[OpenTelemetry]を利用して、インタラクティブなウェブアプリケーションに分散トレーシングを提供する方法を説明します。

source: This guide explains how your Quarkus application can utilize web sockets to create interactive web applications, in the context of an Undertow-based Quarkus application, or if you rely on https://jakarta.ee/specifications/websocket/[Jakarta WebSocket].
ja_jp: このガイドでは、Quarkus アプリケーションが Undertow ベースの Quarkus アプリケーションのコンテキストで、または https://jakarta.ee/specifications/websocket/[Jakarta WebSocket] に依存している場合に、Web ソケットを利用してインタラクティブな Web アプリケーションを作成する方法を説明します。

source: This guide explains how your Quarkus application can utilize web sockets to create interactive web applications.
ja_jp: このガイドでは、QuarkusアプリケーションがWeb Socketを利用してインタラクティブなウェブアプリケーションを作成する方法を説明します。

source: This guide explains how your Quarkus application can utilize web sockets to create interactive web applications. Because it's the _canonical_ web socket application, we are going to create a simple chat application.
ja_jp: このガイドでは、QuarkusアプリケーションがWebSocketを利用してインタラクティブなウェブアプリケーションを作成する方法を説明します。 _定型的な_ WebSocketアプリケーションなので、簡単なチャットアプリケーションを作成します。

source: This guide explains how your Quarkus application can utilize web sockets to create interactive web applications. In this guide, we will develop a very simple chat application using web sockets to receive and send messages to the other connected users.
ja_jp: このガイドでは、Quarkus アプリケーションで Web ソケットを利用してインタラクティブな Web アプリケーションを作成する方法について説明します。 このガイドでは、Web ソケットを使用して、接続している他のユーザーとメッセージを送受信する非常にシンプルなチャットアプリケーションを開発します。

source: This guide explains how your Quarkus application can utilize web sockets to create interactive web applications. Because it’s the canonical web socket application, we are going to create a simple chat application.
ja_jp: このガイドでは、QuarkusアプリケーションがWeb Socketを使用してインタラクティブなウェブアプリケーションを作成する方法を説明します。定型的なWeb Socketアプリケーションなので、簡単なチャットアプリケーションを作成します。

source: This guide explains how your application can build, sign and/or encrypt JWT tokens with a fluent and configurable SmallRye JWT Build API.
ja_jp: このガイドでは、流暢で設定可能なSmallRye JWT Build APIを使って、アプリケーションでJWTトークンを構築、署名、暗号化する方法を説明します。

source: This guide explains how your application can use SmallRye JWT to provide secured access to the Jakarta REST endpoints.
ja_jp: このガイドでは、アプリケーションが SmallRye JWT を使用して Jakarta REST エンドポイントへの安全なアクセスを提供する方法について説明します。

source: This guide explains how your application can utilize SmallRye JWT to provide secured access to the JAX-RS endpoints.
ja_jp: このガイドでは、アプリケーションが SmallRye JWT を利用して、JAX-RS エンドポイントへのセキュアなアクセスを提供する方法を説明します。

source: This guide explains how your application can utilize SmallRye JWT to provide secured access to the Jakarta REST endpoints.
ja_jp: このガイドでは、アプリケーションでSmallRye JWTを利用して、Jakarta RESTエンドポイントへのセキュアなアクセスを提供する方法について説明します。

source: This guide explains how your application can utilize SmallRye JWT to verify JWT tokens and provide secured access to the JAX-RS endpoints.
ja_jp: このガイドでは、アプリケーションがSmallRye JWTを使用してJAX-RSエンドポイントへのセキュアなアクセスを提供する方法を説明します。

source: This guide explains logging and how to configure it.
ja_jp: このガイドでは、ロギングとその設定方法について説明します。

source: This guide explains the various methods supported by Quarkus to authenticate to your Vault.
ja_jp: このガイドでは、Quarkusがサポートする、Vaultへの認証を行うためのさまざまな方法について説明します。

source: This guide focuses on using virtual threads with Reactive Messaging extensions. Please refer to xref:virtual-threads.adoc[Writing simpler reactive REST services with Quarkus Virtual Thread support] to read more about Java virtual threads in general and the Quarkus Virtual Thread support for REST services.
ja_jp: このガイドでは、Reactive Messaging エクステンションを使用した仮想スレッドの使用に焦点を当てます。 Java 仮想スレッド全般と、REST サービスに対する Quarkus 仮想スレッドのサポートについて、詳しくは xref:virtual-threads.adoc[Quarkus 仮想スレッドのサポートを使用してシンプルなりアクティブ RESTORE サービスを作成する] を参照してください。

source: This guide focuses on using virtual threads with the gRPC extensions. Please refer to xref:virtual-threads.adoc[Writing simpler reactive REST services with Quarkus Virtual Thread support] to read more about Java virtual threads in general and the Quarkus Virtual Thread support.
ja_jp: このガイドでは、gRPC エクステンションを使用した仮想スレッドの使用に焦点を当てます。 Java 仮想スレッド全般と Quarkus 仮想スレッドのサポートについて、詳しくは xref:virtual-threads.adoc[Quarkus 仮想スレッドのサポートを使用してシンプルなりアクティブ RESTORE サービスを作成する] を参照してください。

source: This guide has introduced how you can use reactive routes to define an HTTP endpoint. It also describes the structure of the Quarkus HTTP layer and how to write filters.
ja_jp: このガイドでは、Reactive Routesを使用してHTTPエンドポイントを定義する方法を紹介してきました。また、Quarkus HTTPレイヤーの構造とフィルターの書き方についても説明しました。

source: This guide has shown how to send emails from your Quarkus application. The xref:mailer-reference.adoc[mailer reference guide] provides more details about the mailer usage and configuration such as:
ja_jp: このガイドでは、Quarkusアプリケーションからメールを送信する方法を紹介しました。 _mailer_ エクステンションは、JVMとネイティブモードで動作します。
